Public Member Functions | List of all members
ACAPI::API_IKeynoteEventNotifier Class Referenceabstract
Notifications Manager
Defining an interface for a class that will be used to notify keynote event handlers. More...
#include <KeynoteEventHandler.hpp>
 Inheritance diagram for ACAPI::API_IKeynoteEventNotifier:
 Public Member Functions
virtual void  | NotifyKeynoteItemChanges (const API_IKeynoteItemEventHandler &eventHandler) const =0
Notifies the event handler about keynote item changes.
virtual void  | NotifyKeynoteFolderChanges (const API_IKeynoteFolderEventHandler &eventHandler) const =0
Notifies the event handler about keynote folder changes.
Detailed Description
Defining an interface for a class that will be used to notify keynote event handlers.
Since
Archicad 28
Member Function Documentation
◆ NotifyKeynoteFolderChanges()
 virtual void ACAPI::API_IKeynoteEventNotifier::NotifyKeynoteFolderChanges  |  ( |  const API_IKeynoteFolderEventHandler &  |  eventHandler | ) |   const
pure virtual
Notifies the event handler about keynote folder changes.
Parameters
eventHandler | An instance that handles the event.
◆ NotifyKeynoteItemChanges()
 virtual void ACAPI::API_IKeynoteEventNotifier::NotifyKeynoteItemChanges  |  ( |  const API_IKeynoteItemEventHandler &  |  eventHandler | ) |   const
pure virtual
Notifies the event handler about keynote item changes.
Parameters
eventHandler | An instance that handles the event.